<center> Name:Quratulain<br>
Email:QuratulainkhanAIML1@outlook.com<br>
Github:QuratulainkhanAIML1<br>
Title:PandasPracticebyq</center>

Install library pandas

In [8]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

Install library numpy

In [9]:
%pip install numpy

Requirement already satisfied: numpy in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

import libraries

In [10]:
import pandas as pd

In [11]:
import numpy as np

Load dataset

In [36]:
pd.read_csv("data.csv")
df=pd.read_csv("data.csv")
print("Students dataset")
df

Students dataset

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         17 non-null     object
 1   Designation  17 non-null     object
 2   Gender       17 non-null     object
 3   Age          16 non-null     float64
 4   Salary       15 non-null     float64
dtypes: float64(2), object(3)
memory usage: 812.0+ bytes

In [38]:
df.head()

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

In [39]:
# displaying last 5 values
df.tail()

      Name Designation Gender    Age    Salary
12   Ahsan     trainer      M  156.0  110000.0
13   Wajid     teacher      M   67.0    2000.0
14   Naeem     trainer      M   80.0   16000.0
15  Qaisar   professor      M   20.0  170000.0
16   Wajid    Engineer      M   85.0  190000.0

In [40]:
#displaying summary about data
df.describe()

             Age        Salary
count   16.00000  1.500000e+01
mean    48.68750  1.725333e+05
std     35.55975  3.713435e+05
min     20.00000  2.000000e+03
25%     27.50000  3.500000e+04
50%     30.00000  7.000000e+04
75%     61.75000  1.150000e+05
max    156.00000  1.500000e+06

In [41]:
# displaying  a spcific value
df.loc[8]

Name               Eman
Designation    Engineer
Gender                F
Age                28.0
Salary          35000.0
Name: 8, dtype: object

In [42]:
df.loc[8:12]

        Name Designation Gender    Age    Salary
8       Eman    Engineer      F   28.0   35000.0
9   Abdullah     Teacher      M   55.0       NaN
10     Mosib   professor      M   60.0   70000.0
11     Ahmed    engineer      M    NaN   90000.0
12     Ahsan     trainer      M  156.0  110000.0

In [43]:
# to check null values
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [44]:
 # to display a specific column or features
df['Age']

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11      NaN
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

In [45]:
df['Age'].isnull().sum()

np.int64(1)

In [46]:
#replace null values
df['Age']=df['Age'].fillna(df['Age'].median())
df['Age']

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11     30.0
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

In [47]:
df['Age'].isnull().sum()

np.int64(0)

In [48]:
#select two columns
sc = df[['Name' , 'Designation']]
sc

             Name Designation
0         Mukhtar   Professor
1           Azziz     Teacher
2          Mohsin    Engineer
3   Naveed Fatima     Analyst
4           Babar    Engineer
5            Aqsa   Scientist
6           Rafia     Analyst
7           Samra   Scientist
8            Eman    Engineer
9        Abdullah     Teacher
10          Mosib   professor
11          Ahmed    engineer
12          Ahsan     trainer
13          Wajid     teacher
14          Naeem     trainer
15         Qaisar   professor
16          Wajid    Engineer

In [49]:
#display value of column designation
df['Designation']

0     Professor
1       Teacher
2      Engineer
3       Analyst
4      Engineer
5     Scientist
6       Analyst
7     Scientist
8      Engineer
9       Teacher
10    professor
11     engineer
12      trainer
13      teacher
14      trainer
15    professor
16     Engineer
Name: Designation, dtype: object

In [50]:
#selecting three columns
print("Selecting three columns from dataset")
sc=df[['Name','Age','Designation']]
sc

Selecting three columns from dataset

             Name    Age Designation
0         Mukhtar   37.0   Professor
1           Azziz   30.0     Teacher
2          Mohsin   29.0    Engineer
3   Naveed Fatima   30.0     Analyst
4           Babar   25.0    Engineer
5            Aqsa   22.0   Scientist
6           Rafia   29.0     Analyst
7           Samra   26.0   Scientist
8            Eman   28.0    Engineer
9        Abdullah   55.0     Teacher
10          Mosib   60.0   professor
11          Ahmed   30.0    engineer
12          Ahsan  156.0     trainer
13          Wajid   67.0     teacher
14          Naeem   80.0     trainer
15         Qaisar   20.0   professor
16          Wajid   85.0    Engineer

In [51]:
# display name and salary column of row 4,5
df1=df[['Name','Salary']]
df1.loc[4:5]

    Name     Salary
4  Babar  1500000.0
5   Aqsa        NaN

In [52]:
# display name and salary column of row 4,5
df1=df.loc[4:5,['Name','Salary']]
print("Selected rows and columns")
df1

Selected rows and columns

    Name     Salary
4  Babar  1500000.0
5   Aqsa        NaN

In [53]:
# check nullvalue
qurat=df
qurat.isnull().sum()

Name           0
Designation    0
Gender         0
Age            0
Salary         2
dtype: int64

In [54]:
# drop index 9
nd=df.drop(9)
print("Data after dropping index 9")
print(nd)

Data after dropping index 9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M   30.0    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [55]:
# drop index 5and 9
nd=df.drop(index=[5,9])
print("Data after dropping index 5 and 9")
print(nd)

Data after dropping index 5 and 9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M   30.0    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [56]:
#drop column gender
nc=df.drop(columns='Gender')
print("Data after dropping column gender")
print(nc)

Data after dropping column gender
             Name Designation    Age     Salary
0         Mukhtar   Professor   37.0   115000.0
1           Azziz     Teacher   30.0    35000.0
2          Mohsin    Engineer   29.0    50000.0
3   Naveed Fatima     Analyst   30.0    70000.0
4           Babar    Engineer   25.0  1500000.0
5            Aqsa   Scientist   22.0        NaN
6           Rafia     Analyst   29.0    20000.0
7           Samra   Scientist   26.0   115000.0
8            Eman    Engineer   28.0    35000.0
9        Abdullah     Teacher   55.0        NaN
10          Mosib   professor   60.0    70000.0
11          Ahmed    engineer   30.0    90000.0
12          Ahsan     trainer  156.0   110000.0
13          Wajid     teacher   67.0     2000.0
14          Naeem     trainer   80.0    16000.0
15         Qaisar   professor   20.0   170000.0
16          Wajid    Engineer   85.0   190000.0

In [57]:
#drop two columns
nc=df.drop(columns=['Gender','Age'])
print("Data after dropping column gender and age")
print(nc)

Data after dropping column gender and age
             Name Designation     Salary
0         Mukhtar   Professor   115000.0
1           Azziz     Teacher    35000.0
2          Mohsin    Engineer    50000.0
3   Naveed Fatima     Analyst    70000.0
4           Babar    Engineer  1500000.0
5            Aqsa   Scientist        NaN
6           Rafia     Analyst    20000.0
7           Samra   Scientist   115000.0
8            Eman    Engineer    35000.0
9        Abdullah     Teacher        NaN
10          Mosib   professor    70000.0
11          Ahmed    engineer    90000.0
12          Ahsan     trainer   110000.0
13          Wajid     teacher     2000.0
14          Naeem     trainer    16000.0
15         Qaisar   professor   170000.0
16          Wajid    Engineer   190000.0

In [59]:
df = df.dropna(subset=['Salary'])
print(df)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M   30.0    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [60]:
# high salary greater than 50000
hs= df[df['Salary']>50000]
print(hs)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
7           Samra   Scientist      F   26.0   115000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M   30.0    90000.0
12          Ahsan     trainer      M  156.0   110000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [61]:
#sort data
sd=df.sort_values(by='Age',ascending=True)
print(sd)

             Name Designation Gender    Age     Salary
15         Qaisar   professor      M   20.0   170000.0
4           Babar    Engineer      F   25.0  1500000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
6           Rafia     Analyst      F   29.0    20000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
1           Azziz     Teacher      M   30.0    35000.0
11          Ahmed    engineer      M   30.0    90000.0
0         Mukhtar   Professor      M   37.0   115000.0
10          Mosib   professor      M   60.0    70000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
16          Wajid    Engineer      M   85.0   190000.0
12          Ahsan     trainer      M  156.0   110000.0

In [62]:
#grouped and aggregate
grp=df.groupby('Designation')['Salary'].mean()
print(grp)

Designation
Analyst       45000.0
Engineer     443750.0
Professor    115000.0
Scientist    115000.0
Teacher       35000.0
engineer      90000.0
professor    120000.0
teacher        2000.0
trainer       63000.0
Name: Salary, dtype: float64

In [63]:
#step8:Enter a new column
df['Experience_level']=['Senior'if age>35 else 'Junior'for age in df['Age']]
print("\n Add a new column Experience level")
print (df)

 Add a new column Experience level
             Name Designation Gender    Age     Salary Experience_level
0         Mukhtar   Professor      M   37.0   115000.0           Senior
1           Azziz     Teacher      M   30.0    35000.0           Junior
2          Mohsin    Engineer      M   29.0    50000.0           Junior
3   Naveed Fatima     Analyst      F   30.0    70000.0           Junior
4           Babar    Engineer      F   25.0  1500000.0           Junior
6           Rafia     Analyst      F   29.0    20000.0           Junior
7           Samra   Scientist      F   26.0   115000.0           Junior
8            Eman    Engineer      F   28.0    35000.0           Junior
10          Mosib   professor      M   60.0    70000.0           Senior
11          Ahmed    engineer      M   30.0    90000.0           Junior
12          Ahsan     trainer      M  156.0   110000.0           Senior
13          Wajid     teacher      M   67.0     2000.0           Senior
14          Naeem     trainer      M   80.0    16000.0           Senior
15         Qaisar   professor      M   20.0   170000.0           Junior
16          Wajid    Engineer      M   85.0   190000.0           Senior

C:\Users\qurat\AppData\Local\Temp\ipykernel_15256\2912126390.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Experience_level']=['Senior'if age>35 else 'Junior'for age in df['Age']]

Create a series

In [14]:
Series=pd.Series([1,2,3,4,5])
Series

0    1
1    2
2    3
3    4
4    5
dtype: int64

Create a datarange

In [15]:
dates= pd.date_range("20250205",periods=6)
dates

DatetimeIndex(['2025-02-05', '2025-02-06', '2025-02-07', '2025-02-08',
               '2025-02-09', '2025-02-10'],
              dtype='datetime64[ns]', freq='D')

Create a dataframe

In [16]:
df=pd.DataFrame (
     {
        "Name":['Quratulain', 'fatima' ,'zahra' ],
    'Email': ['QuratualinAIML@hotmail.com','fatimazahra@gmail.com','fatimamomin@gmail.com'],
    'Contact':['031456789','03241567823','03245643232'],
    }
   
  
)

Display top rows

In [17]:
df.head(1)

         Name                       Email    Contact
0  Quratulain  QuratualinAIML@hotmail.com  031456789

Display last rows

In [18]:
df.tail(1)

    Name                  Email      Contact
2  zahra  fatimamomin@gmail.com  03245643232

Display middle rows

In [19]:
df.loc[1]

Name                      fatima
Email      fatimazahra@gmail.com
Contact              03241567823
Name: 1, dtype: object

Display datatypes of dataframe

In [20]:
df.dtypes

Name       object
Email      object
Contact    object
dtype: object

Display dataframe

In [21]:
df

         Name                       Email      Contact
0  Quratulain  QuratualinAIML@hotmail.com    031456789
1      fatima       fatimazahra@gmail.com  03241567823
2       zahra       fatimamomin@gmail.com  03245643232

Display dataset

In [22]:
sd

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

display dataframe index

In [23]:
id=df.index
id

RangeIndex(start=0, stop=3, step=1)

Display dataframe columns

In [24]:
cd=df.columns
cd

Index(['Name', 'Email', 'Contact'], dtype='object')

Represent numpy representation of data

In [25]:
df.to_numpy()

array([['Quratulain', 'QuratualinAIML@hotmail.com', '031456789'],
       ['fatima', 'fatimazahra@gmail.com', '03241567823'],
       ['zahra', 'fatimamomin@gmail.com', '03245643232']], dtype=object)

Show a quickly statistics of data

In [26]:
df.describe()

              Name                       Email    Contact
count            3                           3          3
unique           3                           3          3
top     Quratulain  QuratualinAIML@hotmail.com  031456789
freq             1                           1          1

Take a tranpose of dataframe

In [27]:
df.T

,0,1,2
Name,Quratulain,fatima,zahra
Email,QuratualinAIML@hotmail.com,fatimazahra@gmail.com,fatimamomin@gmail.com
Contact,031456789,03241567823,03245643232

sort by an axis

In [28]:
df.sort_index(axis=1, ascending=True)

       Contact                       Email        Name
0    031456789  QuratualinAIML@hotmail.com  Quratulain
1  03241567823       fatimazahra@gmail.com      fatima
2  03245643232       fatimamomin@gmail.com       zahra

Sort by an Column

In [29]:
df.sort_values(by="Name")

         Name                       Email      Contact
0  Quratulain  QuratualinAIML@hotmail.com    031456789
1      fatima       fatimazahra@gmail.com  03241567823
2       zahra       fatimamomin@gmail.com  03245643232

Getitem

In [30]:
df['Email']

0    QuratualinAIML@hotmail.com
1         fatimazahra@gmail.com
2         fatimamomin@gmail.com
Name: Email, dtype: object

Passing a slice select maching rows

In [31]:
df[0:2]

         Name                       Email      Contact
0  Quratulain  QuratualinAIML@hotmail.com    031456789
1      fatima       fatimazahra@gmail.com  03241567823

In [32]:
df.loc[:, ["Name", "Email"]]

         Name                       Email
0  Quratulain  QuratualinAIML@hotmail.com
1      fatima       fatimazahra@gmail.com
2       zahra       fatimamomin@gmail.com

In [33]:
print(dates[1])
print(df.index)

2025-02-06 00:00:00
RangeIndex(start=0, stop=3, step=1)

In [34]:
df.iloc[1]

Name                      fatima
Email      fatimazahra@gmail.com
Contact              03241567823
Name: 1, dtype: object

In [35]:
df=pd.DataFrame (
     {
        "Name":['Quratulain', 'fatima' ,'zahra' ],
    'Email': ['QuratualinAIML@hotmail.com','fatimazahra@gmail.com','fatimamomin@gmail.com'],
    'Contact':['031456789','03241567823','03245643232'],
    }
   
  
)
df

         Name                       Email      Contact
0  Quratulain  QuratualinAIML@hotmail.com    031456789
1      fatima       fatimazahra@gmail.com  03241567823
2       zahra       fatimamomin@gmail.com  03245643232